#### Terraform Initialization ⚙️　`success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan Result</summary>

```terraform
 + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "time_zone"
          + value        = "Asia/Tokyo"
        }
    }

  # aws_iam_role.rds_monitoring will be created
  + resource "aws_iam_role" "rds_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "wordpress-bedrock-prod-rds-monitoring-"
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "WordPress-Bedrock"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.rds_monitoring will be created
  + resource "aws_iam_role_policy_attachment" "rds_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = (known after apply)
    }

  # aws_secretsmanager_secret.db_master_credentials will be created
  + resource "aws_secretsmanager_secret" "db_master_credentials" {
      + arn                            = (known after apply)
      + description                    = "RDS MySQL master user credentials for WordPress"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "wordpress-bedrock-prod-db-master-"
      + policy                         = (known after apply)
      + recovery_window_in_days        = 7
      + region                         = "ap-northeast-1"
      + tags                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "wordpress-bedrock-prod-db-master-credentials"
          + "Project"     = "wordpress-bedrock"
        }
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "wordpress-bedrock-prod-db-master-credentials"
          + "Project"     = "wordpress-bedrock"
        }

      + replica (known after apply)
    }

  # aws_secretsmanager_secret_version.db_master_credentials will be created
  + resource "aws_secretsmanager_secret_version" "db_master_credentials" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "ap-northeast-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # random_password.db_master_password will be created
  + resource "random_password" "db_master_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 32
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + db_secret_arn            = (known after apply)
  + phase4_summary           = (known after apply)
  + rds_address              = (sensitive value)
  + rds_database_name        = "wordpress"
  + rds_endpoint             = (sensitive value)
  + rds_port                 = 3306
  + rds_username             = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @takahiro1226, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Plan`*